rails/app/controllers/messages_controller.rb

  def show
    @message = Message.find_by_uuid(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."uuid" = 'cef24f37-d613-4052-bc42-f23585bcb876') LIMIT 1

  def edit
    @message = Message.find_by_uuid(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."uuid" = 'f5651834-0f75-4a05-b52d-d1f529518182') LIMIT 1

  def create
    @message = Message.new(:raw_message => params[:message][:raw_message])
    if  @message.valid?
      #TODO: multiple to
      a = Mail::Address.new(@message.parsed_message.to[0])
      return create_remote if Domain.remote? a.domain
    end
    return unless validate_message_security

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("to_domain", "created_at", "uuid", "updated_at", "raw_message", "to_endpoint") VALUES(NULL, '2010-05-02 00:36:20', 'd6f7dc95-cbfd-47dc-ac31-441fa57ed08f', '2010-05-02 00:36:20', 'From: drsmith@nhin.sunnyfamilypractice.example.orgTo: drjones@nhin.happyvalleypractice.example.orgDate: Thu, 08 Apr 2010 20:53:17 -0400Message-ID: <db00ed94-951b-4d47-8e86-585b31fe01ba@nhin.sunnyfamilypractice.example.org>MIME-Version: 1.0Content-Type: multipart/mixed; boundary="8837833223134.12.9837473322"This text is traditionally ignored but canhelp non-MIME compliant readers provideinformation.--8837833223134.12.9837473322Content-Type: text/plainAttached is a clinical summary from a recent visit for patient John Doelocated at 123 Main Street, Eagan, MN. John will be scheduling with you forfollow-up in relation to his complaints of frequent headaches.--8837833223134.12.9837473322Content-Type: application/ccd+xml; name="clinicalsummary-johndoe.xml"Content-Transfer-Encoding: base64Content-Disposition: attachment; filename="clinicalsummary-johndoe.xml"<base64 encoded CCD XML file here>--8837833223134.12.9837473322Content-Type: application/pdf; name="clinicalsummary-johndoe.pdf"Content-Transfer-Encoding: base64Content-Disposition: attachment; filename="clinicalsummary-johndoe.pdf"<base64 encoded PDF here>--8837833223134.12.9837473322--', NULL)

  def update
    @message = Message.find_by_uuid(params[:id])
    @message.raw_message = params[:message][:raw_message]

    respond_to do |format|
      if @message.save
---
SELECT * FROM "messages" WHERE ("messages"."uuid" = '63a0b677-86e4-44f4-93ce-54270096d9ac') LIMIT 1
UPDATE "messages" SET "updated_at" = '2010-04-29 00:44:05', "raw_message" = 'From: drsmith@nhin.sunnyfamilypractice.example.org